/*
Пример порождающего шаблона проектирования программ «Абстрактная фабрика»,
который предоставляет интерфейс взаимосвязанных или взаимозависимых объектов,
не специфицируя их конкретных классов. Шаблон применяется в случаях, когда программа
должна быть не зависимой от процессов и типов создаваемых новых объектов, а также,
когда необходимо создавать группы взаимосвязанных объектов.
*/

namespace Pattern_AbstractFactory
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
